---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltLength
source: html/b8b5cc81-7eba-d2dd-b9c5-e82beda3bf13.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltLength Property

"Bolt Length"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemBoltLength { get; }
```